{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "architectures": [
    "TimeSeriesTransformerForPrediction"
  ],
  "attention_dropout": 0.1,
  "cardinality": [
    0
  ],
  "context_length": 49,
  "d_model": 64,
  "decoder_attention_heads": 2,
  "decoder_ffn_dim": 32,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 2,
  "distribution_output": "normal",
  "dropout": 0.1,
  "dtype": "float32",
  "embedding_dimension": [
    0
  ],
  "encoder_attention_heads": 2,
  "encoder_ffn_dim": 32,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 2,
  "feature_size": 7,
  "init_std": 0.02,
  "input_size": 2,
  "is_encoder_decoder": true,
  "lags_sequence": [
    1
  ],
  "loss": "nll",
  "model_type": "time_series_transformer",
  "n_heads": 8,
  "num_dynamic_real_features": 0,
  "num_parallel_samples": 1,
  "num_static_categorical_features": 0,
  "num_static_real_features": 0,
  "num_time_features": 1,
  "prediction_length": 50,
  "scaling": "mean",
  "transformers_version": "4.57.1",
  "use_cache": true
}
